tests/load-test.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 10
      name: 'Warm up the API'
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      name: 'Ramp up to 100 req/s'
    - duration: 60
      arrivalRate: 100
      name: 'Sustain peak load'
scenarios:
  - name: 'Get a list of reviews for a given product (GET /reviews)'
    flow:
      - get:
          url: '/reviews/?page=1&count=5&sort=newest&product_id=10000'
      - get:
          url: '/reviews/meta/?product_id=10000'
      - put:
          url: '/reviews/{{ $randomNumber(10000, 20000) }}/helpful'
      - get:
          url: '/reviews/?page=1&count=5&sort=newest&product_id=100000'
      - get:
          url: '/reviews/meta/?product_id=100000'
      - put:
          url: '/reviews/{{ $randomNumber(10000, 20000) }}/helpful'
      - get:
          url: '/reviews/?page=1&count=5&sort=newest&product_id=500000'
      - get:
          url: '/reviews/meta/?product_id=500000'
      - put:
          url: '/reviews/{{ $randomNumber(10000, 20000) }}/helpful'